src/Enums/ТипыПолитикУказанияСерий/ТипыПолитикУказанияСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПолитикУказанияСерий</name>
  <enumValues>
    <name>СправочноеУказаниеСерий</name>
  </enumValues>
  <enumValues>
    <name>АвторасчетПоFEFOОстатковСерий</name>
  </enumValues>
  <enumValues>
    <name>УправлениеПоFEFOОстаткамиСерий</name>
  </enumValues>
  <enumValues>
    <name>УправлениеОстаткамиСерий</name>
  </enumValues>
  <enumValues>
    <name>УчетСебестоимостиПоСериям</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыПолитикУказанияСерий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий);
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий);
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий);
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям);
	КонецЕсли;
	
	ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
		"ТипыПолитикУказанияСерий",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецОбласти
